/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   inter.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sjacinda <sjacinda@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/12/06 14:33:46 by sjacinda          #+#    #+#             */
/*   Updated: 2021/12/06 22:03:25 by sjacinda         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <unistd.h>

void	ft_inter(char *s1, char *s2)
{
	char	arr[256] = {0};	// заполняем массив нулями
	int		i;

	i = 0;
	while (s2[i])
	{
		arr[(int)s2[i]] = 1;	// переводим по ASCII символ второй строки в число и ставим в массиве 1
		i++;
	}
	i = 0;
	while (s1[i])
	{
		if (arr[(int)s1[i]] == 1)	// если символ второй строки == символу первой, то в массиве уже будет 1
		{
			write(1, &s1[i], 1);	// печатаем совпавший символ
<<<<<<< HEAD
			arr[(int)s1[i]] = 2;	// и ставим в массиве 2, чтобы больше не повторться
=======
			arr[(int)s1[i]] = 2;	// и больше не повторяемся - ставим в массиве 2
>>>>>>> a5ce8d6959f79189e6a4093d54ac51f7f5772113
		}
		i++;
	}
}

int	main(int argc, char	**argv)
{
	if (argc == 3)	// защита - если на вход подаётся не 2 строки, то печатем '\n'
		ft_inter(argv[1], argv[2]);	// подаём в функцию две строки
	write(1, "\n", 1);
	return (0);
}
