/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   union.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sjacinda <sjacinda@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/12/06 21:37:31 by sjacinda          #+#    #+#             */
/*   Updated: 2021/12/07 13:37:19 by sjacinda         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <unistd.h>

void	ft_union(char *s1, char *s2)
{
	char	arr[256] = {0};	// заполняем массив нулями
	int		i;

	i = 0;
	while (s1[i])
	{
		if (arr[(int)s1[i]] == 0)
		{
			write(1, &s1[i], 1);	// печатаем символ
			arr[(int)s1[i]] = 1;	// и ставим в массиве 1, чтобы больше не повторться в первой строке
		}
		i++;
	}
	i = 0;
	while (s2[i])
	{
		if (arr[(int)s2[i]] == 0)
		{
			write(1, &s2[i], 1);	// печатаем символ
			arr[(int)s2[i]] = 1;	// и ставим в массиве 1, чтобы больше не повторться во второй строке
		}
		i++;
	}
}

int	main(int argc, char **argv)
{
	if (argc == 3)	// защита - если на вход подаётся не 2 строки, то печатем '\n'
		ft_union(argv[1], argv[2]);	// подаём в функцию две строки
	write(1, "\n", 1);
	return (0);
}
