/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   get_next_line.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sjacinda <sjacinda@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/12/07 13:41:52 by sjacinda          #+#    #+#             */
/*   Updated: 2021/12/07 15:19:41 by sjacinda         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "get_next_line.h"

int	get_next_line(char **line)
{
	int	i;
	int	count_read;

	i = 0;
	*line = (char *)malloc(100);
	while ((count_read = read(0, *line + i, 1)) > 0)	// читает из стандартного ввода (fd == 0)
	{
		if ((*line)[i] == '\n')
			break ;
		i++;
	}
	(*line)[i] = '\0';	// обозначается конец прочитанной строки
	return (count_read);	// если произойдёт ошибка чтения, то вернётся -1, так работает функция read
}
